/**********************************************************
1.实验名称:OLED显示
2.实验环境:STM32F103C8T6最小系统板
3.实验内容：OLED显示
4.作者；abai
5.实验时间：2025-2-24
**********************************************************/
#include "stm32f10x.h"                  // Device header
#include "Delay.h"						//延时函数
#include "OLED.h"

int main(void)
{
	/*
		OLED初始化
	*/
	OLED_Init();
	/*
		OLED显示
	*/
//	OLED_ShowChar(1,1,'A');							//OLED显示字符
	OLED_ShowString(1,3,"lihh!");					//注意计算字符串的长度，切勿超出屏幕的长度
//	OLED_ShowNum(2,1,12345,5);						//OLED显示无符号十进制数
//	OLED_ShowNum(2,1,12345,6);						//显示无符号十进制数时，当第四个参数显示数字的长度的值大于第三个参数要显示的数字时会在高位补零
//	OLED_ShowNum(2,1,12345,4);						//显示无符号十进制数时，当第四个参数显示数字的长度的值小于第三个参数要显示的数字时会在高位不显示
//	OLED_ShowNum(1,12,123456,6);					//当一行显示的字符的长度超过屏幕的宽度时，超出的部分则不显示
//	OLED_ShowSignedNum(2,6,123,3);					//显示有符号十进制整数，对要显示的数字默认为正整数，附带正号
//	OLED_ShowSignedNum(2,6,-64,2);					//显示负数
//	OLED_ShowHexNum(3,1,0XAA55,4);					//OLED显示十六进制数
//	OLED_ShowBinNum(4,1,0xAA55,16);					//OLED显示二进制数，由于C语言不能直接写二进制数，故需使用十六进制数表示二进制数
//	
//	OLED_Clear();									//OLED清屏
	while(1)
	{
		
	}
}
